app/Controllers/Auth.php

SELECT *
FROM `Usuarios`
WHERE `usuario` = 'admin'
 LIMIT 1
UPDATE `Usuarios` SET `fecha_ultimo_ingreso` = '2025-10-27 02:40:01'
WHERE `Usuarios`.`id` IN ('1')
---
    public function attemptLogin()
    {
        // 1. Validar que los campos no estén vacíos
        $rules = [
            'login_identifier' => 'required', // El campo del form se llamará 'login_identifier'
            'password'         => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('/login')->with('errors', $this->validator->getErrors());
        }

        $identifier = $this->request->getPost('login_identifier');
        $password = $this->request->getPost('password');

        $usuarioModel = new UsuarioModel();
        $estudianteModel = new EstudianteModel();

        // 2. Lógica de autenticación simplificada y correcta
        // Buscamos directamente por el nombre de usuario ('admin', 'profesor1', 'alumno1', etc.)
        $usuario = $usuarioModel->where('usuario', $identifier)->first();

        // 3. Verificar contraseña y crear sesión
        // NOTA: Se usa md5() para la verificación, según lo solicitado.
        // Para mayor seguridad en proyectos futuros, se recomienda password_hash() y password_verify().
        if ($usuario && md5((string)$password) === $usuario['password']) {
            // ¡Login exitoso!
            $this->setUserSession($usuario);

            // Actualizar fecha de último ingreso
            $usuarioModel->update($usuario['id'], ['fecha_ultimo_ingreso' => date('Y-m-d H:i:s')]);

SELECT *
FROM `Rol`
WHERE `Rol`.`id` = '1'
---
    private function setUserSession($usuario)
    {
        $rolModel = new RolModel();
        $rol = $rolModel->find($usuario['rol_id']);