app/Controllers/Categorias.php

SELECT *
FROM `categoria`
---
    public function index()
    {
        // Para evitar error de conexión a base de datos, mostramos la vista con datos vacíos si no hay conexión.
        try {
            $model = new CategoriaModel();
            $data['categorias'] = $model->findAll();