app/Controllers/Estudiantes.php

SELECT *
FROM `carrera`
---
    public function index()
    {
        // Para evitar error de conexión a base de datos, mostramos la vista con datos vacíos si no hay conexión.
        try {
            // Instancia los modelos necesarios.
            $estudianteModel = new EstudianteModel();
            $carreraModel = new CarreraModel();

            // Prepara un array '$data' para pasar información a la vista.
            $data['estudiantes'] = $estudianteModel->getEstudiantesConCarrera();
            $data['carreras'] = $carreraModel->findAll();