app/Controllers/Usuarios.php

    public function index()
    {
        $data['usuarios'] = $this->usuarioModel->findAll();
---
SELECT *
FROM `Usuarios`