app/Models/EstudianteModel.php

    public function getEstudiantesConCarrera()
    {
        // Construye una consulta SELECT que une la tabla 'Estudiante' con 'Carrera'.
        return $this->select('estudiante.*, carrera.nombre_carrera')
            ->join('carrera', 'carrera.id = estudiante.carrera_id', 'left') // 'left' join para incluir estudiantes sin carrera.
            ->findAll(); // Ejecuta la consulta y devuelve todos los resultados.
---
SELECT `Estudiante`.*, `Carrera`.`nombre_carrera`
FROM `Estudiante`
LEFT JOIN `Carrera` ON `Carrera`.`id` = `Estudiante`.`carrera_id`